Config/Reports/ЖурналУчетаПолученныхВыставленныхСчетовФактур735.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЖурналУчетаПолученныхВыставленныхСчетовФактур735</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Reports/ЖурналУчетаПолученныхВыставленныхСчетовФактур735/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем ОтключитьВыводЛистаПриВыбореСтрокиВТаблице;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация:
	РегламентированныеРегистры.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		СписокКодовОпераций,
		,
		Отчет["НачалоПериода"]);
	
	НастроитьФормуСервер_ОтчетПокаНеСформирован();
	
	//---
	// Механизм связи полей шапки и отбора
	//---
	СвязьПолейШапкиИОтбора_ПриСозданииНаСервере();
	//---
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтключитьВыводЛистаПриВыбореСтрокиВТаблице = Истина;
	
	НастроитьФормуКлиент_ОбновитьЗаголовокФормы();
	
	НастроитьФормуКлиент_ПриИзмененииПоКонтрагентам();
	
	//---
	// Механизм связи полей шапки и отбора
	//---
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриОткрытии(ЭтаФорма, Отчет);
	//---
	
	// Гарантируем установку хотя бы одного флажка ВыводитьЧасть1,2:
	ОбработатьИзменениеФлажкаВыводитьЧастьN(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ВариантМодифицирован = Ложь;
	
	ПользовательскиеНастройкиМодифицированы = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	РегламентированныеРегистры.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	РегламентированныеРегистры.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	НастроитьФормуСервер_ВидимостьНастроек();
	НастроитьФормуСервер_ВидимостьПанелиНалоговыеПериоды();
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
	//---
	// Механизм связи полей шапки и отбора
	//---
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриОткрытии(ЭтаФорма, Отчет);
	//---
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// --------
// Внимание
// --------
// Следующие обработчики подключаются программно механизмом связи полей шапки и отбора:
// (см. Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииПоляШапки)
//  - ОрганизацияПриИзменении
//  - ИФОПриИзменении
//  - КонтрагентПриИзменении

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		СписокКодовОпераций,
		,
		Отчет["НачалоПериода"]);
		
КонецПроцедуры
&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЧасть1ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаВыводитьЧастьN(1);
	
КонецПроцедуры
&НаКлиенте
Процедура ВыводитьЧасть2ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаВыводитьЧастьN(2);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьИтогиПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоКонтрагентамПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииПоКонтрагентам();
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НумероватьВнутриКонтрагентаПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "Таблица сформированных листов"

&НаКлиенте
Процедура ТаблицаСформированныхЛистовПриАктивизацииСтроки(Элемент)
	
	Если ОтключитьВыводЛистаПриВыбореСтрокиВТаблице = Истина Тогда
		ОтключитьВыводЛистаПриВыбореСтрокиВТаблице = Ложь;
		Возврат;
	КонецЕсли;
	
	ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
	
	ПодключитьОбработчикОжидания("Подключаемый_ТаблицаСформированныхЛистовПриАктивизацииСтроки", ИнтервалОжидания, Истина);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ТаблицаСформированныхЛистовПриАктивизацииСтроки()
	
	ИдТекущейСтроки = Элементы["ТаблицаСформированныхЛистов"].ТекущаяСтрока;
	
	ПоказатьВыбранныйЛистСервер(ИдТекущейСтроки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "Табличный документ отчета"

&НаКлиенте
Процедура ОтчетТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
	
	ПодключитьОбработчикОжидания("Подключаемый_РассчитатьСуммуЯчеек", ИнтервалОжидания, Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "Отбор"

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// Организуем кнопку выбора для строкового поля "КодВидаОперации":
	ЭлементОтбор	= Элементы["Отбор"];
	ТекДанные		= ЭлементОтбор.ТекущиеДанные;
	ИмяКолонки		= ЭлементОтбор.ТекущийЭлемент.Имя;
	Если ТекДанные.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодВидаОперации") И ИмяКолонки = "ОтборПравоеЗначение" Тогда
		ЭлементОтбор.ТекущийЭлемент.КнопкаВыбора = Истина;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Организуем выбор из списка строк для строкового поля "КодВидаОперации":
	ЭлементОтбор	= Элементы["Отбор"];
	ТекДанные		= ЭлементОтбор.ТекущиеДанные;
	ТекСтрока		= ЭлементОтбор.ТекущаяСтрока;
	ИмяКолонки		= ЭлементОтбор.ТекущийЭлемент.Имя;
	Если ТекДанные.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодВидаОперации") Тогда	
		ТекЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ТекСтрока);
		Если СтандартныеОтчетыКлиентСервер.ЭтоЭлементОтбораСОднимУказаннымЗначением(ТекЭлементОтбора) Тогда
			ПравоеЗначение = ТекДанные["ПравоеЗначение"];
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ТекЭлементОтбора",	ТекЭлементОтбора);
			
			ОписаниеОповещения_Выбор = Новый ОписаниеОповещения("ОтборПравоеЗначениеНачалоВыбора_Выбор", ЭтотОбъект, ДополнительныеПараметры);
			
			ПоказатьВыборИзСписка(ОписаниеОповещения_Выбор, СписокКодовОпераций, Элемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПравоеЗначениеНачалоВыбора_Выбор(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		ТекЭлементОтбора	= ДополнительныеПараметры["ТекЭлементОтбора"];
		
		ТекЭлементОтбора.ПравоеЗначение = ВыбранныйЭлемент.Значение;
	КонецЕсли;	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	ВидимостьНастроек = НЕ ВидимостьНастроек;
	
	НастроитьФормуСервер_ВидимостьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура НалоговыеПериоды(Команда)
	
	ВидимостьНалоговыеПериоды = НЕ ВидимостьНалоговыеПериоды;
	
	НастроитьФормуСервер_ВидимостьПанелиНалоговыеПериоды();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Перем ИдТекущейСтрокиТаблицыСформированныхЛистов;
	
	ОчиститьСообщения();
	
	ОтключитьВыводЛистаПриВыбореСтрокиВТаблице = Истина;
	
	СформироватьОтчетСервер(ИдТекущейСтрокиТаблицыСформированныхЛистов);
	
	УстановитьТекущуюСтрокуВТаблицеСформированныхЛистов(ИдТекущейСтрокиТаблицыСформированныхЛистов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода", Отчет.НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода",  Отчет.КонецПериода);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма, "УстановитьПериодЗавершение");
	
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		СписокКодовОпераций,
		,
		Отчет["НачалоПериода"]);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Отчет.НачалоПериода = РезультатВыбора.НачалоПериода;
		Отчет.КонецПериода  = РезультатВыбора.КонецПериода;
		ЭтаФорма.Модифицированность = Истина;
		
		НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	КонецЕсли
	
КонецПроцедуры

// Скопировано из общей формы "ФормаОтчета"
&НаКлиенте
Процедура ВычислитьСумму(Команда)
	СуммаВыделенныхЯчеек = ВычислитьСуммуСервер(ОтчетТабличныйДокумент, ВыделенныеОбласти());
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере // вызывается из общего модуля
Процедура ОпределитьИменаСохраняемыхРеквизитов() Экспорт
	
	// Реквизиты отчета:
	ИменаСохраняемыхРеквизитовОтчета = "
		|Организация,
		|НачалоПериода,
		|КонецПериода";
		
	// Реквизиты формы:
	ИменаСохраняемыхРеквизитовФормы = "
		|ВидимостьНастроек,
		|ВидимостьНалоговыеПериоды,
		|ВыводитьЧасть1,
		|ВыводитьЧасть2,
		|ВыводитьИтоги,
		|ВыводитьОтбор,
		|Контрагент,
		|ГруппироватьПоКонтрагентам,
		|НумероватьВнутриКонтрагента";
	
КонецПроцедуры
&НаСервере
Функция ПолучитьПараметрыОтчета()
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",							Отчет["Организация"]);
	ПараметрыОтчета.Вставить("НачалоПериода",						Отчет["НачалоПериода"]);
	ПараметрыОтчета.Вставить("КонецПериода",						Отчет["КонецПериода"]);
	ПараметрыОтчета.Вставить("ВыводитьЧасть1",						ЭтаФорма["ВыводитьЧасть1"]);
	ПараметрыОтчета.Вставить("ВыводитьЧасть2",						ЭтаФорма["ВыводитьЧасть2"]);
	ПараметрыОтчета.Вставить("ВыводитьИтоги",						ЭтаФорма["ВыводитьИтоги"]);
	ПараметрыОтчета.Вставить("ВыводитьОтбор",						ЭтаФорма["ВыводитьОтбор"]);
	ПараметрыОтчета.Вставить("ГруппироватьПоКонтрагентам",			ЭтаФорма["ГруппироватьПоКонтрагентам"]);
	ПараметрыОтчета.Вставить("НумероватьВнутриКонтрагента",			ЭтаФорма["НумероватьВнутриКонтрагента"]);
	
	ПараметрыОтчета.Вставить("КомпоновщикНастроек",					Отчет["КомпоновщикНастроек"]);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы",		ЭтаФорма.УникальныйИдентификатор);
	
	ПараметрыОтчета.Вставить("Колонтитулы_НаименованиеОтчета",		РеквизитФормыВЗначение("Отчет").Метаданные().Синоним);
	ПараметрыОтчета.Вставить("Колонтитулы_ТекущийПользователь",		Строка(ПользователиКлиентСервер.АвторизованныйПользователь()));
	
	Возврат ПараметрыОтчета;
	
КонецФункции
&НаСервере
Процедура СформироватьОтчетСервер(ВозвратИдТекущейСтрокиТаблицыСформированныхЛистов) Экспорт
	
	Если ПроверитьЗаполнение() Тогда
		ПараметрыОтчета = ПолучитьПараметрыОтчета();
		
		Отчеты.ЖурналУчетаПолученныхВыставленныхСчетовФактур735.СформироватьОтчет(ПараметрыОтчета, АдресХранилищаРезультатовОтчета);
		
		// Заполняем дерево сформированных листов и выводим первый табличный документ:
		ВозвратИдТекущейСтрокиТаблицыСформированныхЛистов = НастроитьФормуСервер_ЗаполнитьРезультатамиОтчета();
		
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере // вызывается из общего модуля
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки = Неопределено) Экспорт
	
	Если ЗаполняемыеНастройки = Неопределено Тогда
		// Задаем настройки по умолчанию при первом открытии отчета:
		ВидимостьНастроек	= Истина;
		ВыводитьЧасть1		= Истина;
		ВыводитьЧасть2		= Истина;
	Иначе
		// Настраиваем отчет по переданным параметрам.
		// Устанавливаем реквизиты отчета:
		ВремСтруктура = Новый Структура(ИменаСохраняемыхРеквизитовОтчета);
		ЗаполнитьЗначенияСвойств(ВремСтруктура, ЗаполняемыеНастройки);
		ЗаполнитьЗначенияСвойств(Отчет, ВремСтруктура);
		
		// Устанавливаем реквизиты формы:
		ВремСтруктура = Новый Структура(ИменаСохраняемыхРеквизитовФормы);
		ЗаполнитьЗначенияСвойств(ВремСтруктура, ЗаполняемыеНастройки);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ВремСтруктура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте // вызывается в том числе механизмом связи полей шапки и отбора
Процедура НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(УстановитьСостояниеТабличногоДокумента = Истина) Экспорт
	
	НастроитьФормуКлиент_ОбновитьЗаголовокФормы();
	
	Если УстановитьСостояниеТабличногоДокумента Тогда
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	КонецЕсли;
	
	//---
	// Механизм автоматической установки флажка "Выводить отбор"
	//---
	Попытка
		АвтоматическаяУстановкаФлажкаВыводитьОтбор_ОбновитьСостояниеФлажка();
	Исключение
	КонецПопытки;
	//---
	
КонецПроцедуры
&НаСервере
Процедура НастроитьФормуСервер_ВидимостьНастроек()
	
	НовВидимость = ВидимостьНастроек;
	
	Элементы["ГруппаПанельНастроек"].Видимость	= НовВидимость;
	Элементы["ПанельНастроек"].Пометка			= НовВидимость;
	
КонецПРоцедуры
&НаСервере
Процедура НастроитьФормуСервер_ВидимостьПанелиНалоговыеПериоды()
	
	НовВидимость = ВидимостьНалоговыеПериоды;
	
	Элементы["ГруппаПанельНалоговыеПериоды"].Видимость	= НовВидимость;
	Элементы["НалоговыеПериоды"].Пометка				= НовВидимость;
	
КонецПроцедуры
&НаКлиенте
Процедура НастроитьФормуКлиент_ОбновитьЗаголовокФормы()
	
	ЗаголовокОтчета = НСтр("ru='Журнал учета полученных, выставленных счетов фактур'")
		+ СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
			Отчет["НачалоПериода"],
			Отчет["КонецПериода"]);
	
	ЭтаФорма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры
&НаСервере
Процедура НастроитьФормуСервер_ОтчетПокаНеСформирован()
	
	СлужебнаяСтрока = ТаблицаСформированныхЛистов.Добавить();
	СлужебнаяСтрока["Наименование"]						= НСтр("ru='отчет пока не сформирован'");
	СлужебнаяСтрока["Картинка"]							= БиблиотекаКартинок.Информация;
	СлужебнаяСтрока["ПредставлениеНалоговогоПериода"]	= НСтр("ru='данные отсутствуют'");
	
	ВыбранныйНалоговыйПериод = СлужебнаяСтрока["ПредставлениеНалоговогоПериода"];
	
КонецПроцедуры
&НаКлиенте
Процедура НастроитьФормуКлиент_ПриИзмененииПоКонтрагентам()
	
	НовДоступность = ГруппироватьПоКонтрагентам;
	
	Если НЕ НовДоступность Тогда
		НумероватьВнутриКонтрагента = Ложь;
	КонецЕсли;
	
	Элементы["НумероватьВнутриКонтрагента"].Доступность = НовДоступность;
	
	НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	
КонецПроцедуры
&НаСервере
Функция НастроитьФормуСервер_ЗаполнитьРезультатамиОтчета()
	
	Перем ИдТекущейСтроки;
	
	РезультатыОтчета = ПолучитьИзВременногоХранилища(АдресХранилищаРезультатовОтчета);
	
	// Заполняем таблицу листов:
	ТаблицаСформированныхЛистов.Загрузить(РезультатыОтчета["ТаблицаСформированныхЛистов"]);
	
	// Показываем самый первый лист:
	Попытка
		ИдТекущейСтроки = ТаблицаСформированныхЛистов[0].ПолучитьИдентификатор();
	Исключение
	КонецПопытки;
	ПоказатьВыбранныйЛистСервер(ИдТекущейСтроки);
	
	Возврат ИдТекущейСтроки;
	
КонецФункции
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УчетНДС.УстановитьУсловноеОформлениеВКнигеПокупокИлиКнигеПродаж(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлажкаВыводитьЧастьN(НомерЧасти)
	
	СброшеныВсеФлажки = (НЕ ВыводитьЧасть1 И НЕ ВыводитьЧасть2);
	Если СброшеныВсеФлажки Тогда
		// Принудительно устанавливаем только что сброшенный флажок:
		ЭтаФорма["ВыводитьЧасть" + НомерЧасти] = Истина;
	Иначе
		НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьВыбранныйЛистСервер(ИдТекущейСтрокиТаблицыСформированныхЛистов)
	
	ОтчетТабличныйДокумент.Очистить();
	
	Попытка
		ТекДанные = ТаблицаСформированныхЛистов.НайтиПоИдентификатору(ИдТекущейСтрокиТаблицыСформированныхЛистов);
		АдресХранилищаСДаннымиЛиста	= ТекДанные["АдресХранилищаСДаннымиЛиста"];
		ЭтоПустойЛист				= ТекДанные["ЭтоПустойЛист"];
		
		ДанныеЛиста = ПолучитьИзВременногоХранилища(АдресХранилищаСДаннымиЛиста);
		ТабличныйДокументЛиста = ДанныеЛиста["ТабличныйДокумент"];
		
		ОтчетТабличныйДокумент.Вывести(ТабличныйДокументЛиста);
		ЗаполнитьЗначенияСвойств(ОтчетТабличныйДокумент, ТабличныйДокументЛиста);
		
		ИмяНовойТекущейОбласти = Неопределено;
		Если ЭтоПустойЛист Тогда
			ИмяНовойТекущейОбласти = "R1C1";
		Иначе
			ВысотаТабДокумента = ТабличныйДокументЛиста.ВысотаТаблицы;
			НомерНижнейВыбраннойСтроки = Элементы["ОтчетТабличныйДокумент"].ТекущаяОбласть.Низ;
			Если НомерНижнейВыбраннойСтроки > ВысотаТабДокумента Тогда
				НомерВыбраннойСтроки = ВысотаТабДокумента - 8;
				Если НомерВыбраннойСтроки < 1 Тогда
					НомерВыбраннойСтроки = 1;
				КонецЕсли;
				ИмяНовойТекущейОбласти = "R" + Формат(НомерВыбраннойСтроки, "ЧГ=0") + "C1";
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяНовойТекущейОбласти) Тогда
			Элементы["ОтчетТабличныйДокумент"].ТекущаяОбласть = ОтчетТабличныйДокумент.Область(ИмяНовойТекущейОбласти);
		КонецЕсли;
		
		ВыбранныйНалоговыйПериод = ТекДанные["ПредставлениеНалоговогоПериода"];
	Исключение
	КонецПопытки;
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьТекущуюСтрокуВТаблицеСформированныхЛистов(ИдТекущейСтрокиТаблицыСформированныхЛистов)
	
	ЭлементТаблица = Элементы["ТаблицаСформированныхЛистов"];
	
	// Выбираем указанную строку:
	Если ЗначениеЗаполнено(ИдТекущейСтрокиТаблицыСформированныхЛистов) Тогда
		ЭлементТаблица.ТекущаяСтрока = ИдТекущейСтрокиТаблицыСформированныхЛистов;
	КонецЕсли;
	
КонецПроцедуры

// Скопировано из общей формы "ФормаОтчета"
&НаКлиенте
Функция ВыделенныеОбласти()
	Результат = Новый Массив;
	Для Каждого ВыделеннаяОбласть Из ОтчетТабличныйДокумент.ВыделенныеОбласти Цикл
		Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		Структура = Новый Структура("Верх, Низ, Лево, Право, ТипОбласти");
		ЗаполнитьЗначенияСвойств(Структура, ВыделеннаяОбласть);
		Результат.Добавить(Структура);
	КонецЦикла;
	Возврат Результат;
КонецФункции
&НаКлиенте
Процедура Подключаемый_РассчитатьСуммуЯчеек()
	
	Сумма = СтандартныеОтчетыКлиентСервер.РассчитатьСуммуВыделенныхЯчеек(ОтчетТабличныйДокумент, Неопределено);
	Если ТипЗнч(Сумма) = Тип("Число") Тогда
		СуммаВыделенныхЯчеек = Формат(Сумма, "ЧН=0");
	Иначе
		СуммаВыделенныхЯчеек = "-";
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ВычислитьСуммуСервер(Знач ОтчетТабличныйДокумент, Знач ВыделенныеОбласти)
	Сумма = СтандартныеОтчетыКлиентСервер.РассчитатьСуммуВыделенныхЯчеек(ОтчетТабличныйДокумент, ВыделенныеОбласти);
	Возврат Формат(Сумма, "ЧН=0");
КонецФункции

//------------------------------------------------------------------------------
// Механизм автоматической установки флажка "Выводить отбор"

&НаКлиенте
Процедура АвтоматическаяУстановкаФлажкаВыводитьОтбор_ОбновитьСостояниеФлажка()
	
	РеквизитыШапки = Новый Структура("Организация", Отчет["Организация"]);
	
	ВыводитьОтбор = НЕ ВыводитьЧасть1 ИЛИ НЕ ВыводитьЧасть2
		ИЛИ СтандартныеОтчетыКлиентСервер.УстановленДополнительныйОтбор(Отчет.КомпоновщикНастроек.Настройки.Отбор, РеквизитыШапки);
	
КонецПроцедуры

// Механизм автоматической установки флажка "Выводить отбор"
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Механизм связи полей шапки и отбора

&НаСервере
Процедура СвязьПолейШапкиИОтбора_ПриСозданииНаСервере()
	
	МассивСтрокСвязи = Новый Массив();
	
	// Организация:
	СтрокаСвязи = Новый Структура();
	СтрокаСвязи.Вставить("РежимСвязи",						"ИндикаторСвязи");
	СтрокаСвязи.Вставить("ШапкаИмяЭлементаПоля",			"Организация");
	СтрокаСвязи.Вставить("ОтборИмяЭлементаТаблицы",			"Отбор");
	СтрокаСвязи.Вставить("ОтборИмяПоля",					"Организация");
	МассивСтрокСвязи.Добавить(СтрокаСвязи);
	
	// ИФО:
	СтрокаСвязи = Новый Структура();
	СтрокаСвязи.Вставить("РежимСвязи",						"ИндикаторСвязи");
	СтрокаСвязи.Вставить("ШапкаИмяЭлементаПоля",			"ИФО");
	СтрокаСвязи.Вставить("ОтборИмяЭлементаТаблицы",			"Отбор");
	СтрокаСвязи.Вставить("ОтборИмяПоля",					"ИФО");
	СтрокаСвязи.Вставить("ШапкаИменаФункциональныхОпций",	"ИспользоватьУчетПоИФО");
	СтрокаСвязи.Вставить("ВыводитьНадписьПомимоЗамка",		Ложь);
	МассивСтрокСвязи.Добавить(СтрокаСвязи);
	
	// Контрагент:
	СтрокаСвязи = Новый Структура();
	СтрокаСвязи.Вставить("РежимСвязи",						"ИндикаторСвязи");
	СтрокаСвязи.Вставить("ШапкаИмяЭлементаПоля",			"Контрагент");
	СтрокаСвязи.Вставить("ОтборИмяЭлементаТаблицы",			"Отбор");
	СтрокаСвязи.Вставить("ОтборИмяПоля",					"Контрагент");
	СтрокаСвязи.Вставить("ВыводитьНадписьПомимоЗамка",		Ложь);
	МассивСтрокСвязи.Добавить(СтрокаСвязи);
	
	СтандартныеОтчеты.СвязьПолейШапкиИОтбора_ПриСозданииНаСервере(ЭтаФорма,
		МассивСтрокСвязи,					// МассивСтрокСвязи
		ИменаСохраняемыхРеквизитовФормы,	// ИменаСохраняемыхРеквизитовФормы
		);									// ИменаСозданныхРеквизитовФормы
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьНеУстановлена(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьНеУстановлена(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьУстановлена(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьУстановлена(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииПоляШапки(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриИзмененииПоляШапки(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаПоВсем(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаПоВсем(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьНеУстановлена(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьНеУстановлена(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьУстановлена(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьУстановлена(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриНачалеРедактированияСтрокиОтбора(Элемент, НоваяСтрока, Копирование)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриНачалеРедактированияСтрокиОтбора(ЭтаФорма, Отчет, Элемент, НоваяСтрока, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора(ЭтаФорма, Отчет, Элемент, НоваяСтрока, ОтменаРедактирования);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПослеУдаленияСтрокиОтбора(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_СвязьПолейШапкиИОтбора_ПослеУдаленияСтрокиОтбора_Служебный", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПослеУдаленияСтрокиОтбора_Служебный()
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриОткрытии(ЭтаФорма, Отчет);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура умероватьВнутриКонтрагентаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

// Механизм связи полей шапки и отбора
//------------------------------------------------------------------------------
